facts = [
    "У 1642 році Блез Паскаль створив паскаліну — механічний калькулятор, здатний виконувати додавання та віднімання",
    "У 1936 році Тюрінг запропонував концепцію універсальної обчислювальної машини, яка стала основою теоретичної комп'ютерної науки",
    "Перший електронний загальнопризначений комп'ютер, ENIAC, був завершений у 1945 році і займав цілу кімнату, споживаючи величезну кількість електроенергії",
    "Ada Lovelace, вважається першою програмісткою, написала алгоритм для аналітичної машини Чарльза Бебіджа в середині 1800-х років",
    "У 1971 році компанія Intel випустила перший мікропроцесор — Intel 4004, що стало важливим кроком до персональних комп'ютерів",
    "IBM представила свій перший персональний комп'ютер, IBM PC, у 1981 році, заклавши основи для сучасних ПК",
    "В історії обчислювальної техніки важливу роль відіграла криптографія; під час Другої світової війни комп'ютери використовувалися для розшифровки німецьких кодів",
    "Поява ARPANET у 1969 році вважається початком Інтернету, що спочатку був проектом для обміну інформацією між університетами та військовими",
    "У 1984 році Apple представила Macintosh, перший комп'ютер з графічним інтерфейсом, що спростило використання ПК для широкого загалу",
    "Перші експерименти в галузі штучного інтелекту розпочалися в 1950-х роках, але справжній бум технологій AI спостерігається тільки в останні десятиліття"
]

function randomFacts(){
    const randFactsIndex = Math.floor(Math.random() * facts.length);
    document.getElementById("fact-text").innerHTML = "Цікавий факт: " + facts[randFactsIndex];
}

randomFacts()